# StairsCommonRunGenerateLayoutFailure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..StairsCommonRunGenerateLayoutFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Fail to get base line thus fail to generate run layout
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StairsCommonRunGenerateLayoutFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsCommonRunGenerateLayoutFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StairsCommonRunGenerateLayoutFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace